In [1]:
print ("hello")

hello

In [11]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, np.nan, np.nan, 40],
    'City': ['Delhi', 'Mumbai', np.nan, 'Chennai']
}

df = pd.DataFrame(data)
print(df)

# Detect missing values
print("\nMissing values:\n", df.isnull())

      Name   Age     City
0    Alice  25.0    Delhi
1      Bob   NaN   Mumbai
2  Charlie   NaN      NaN
3    David  40.0  Chennai

Missing values:
     Name    Age   City
0  False  False  False
1  False   True  False
2  False   True   True
3  False  False  False

In [3]:
df_drop_rows = df.dropna()
df

      Name   Age     City
0    Alice  25.0    Delhi
1      Bob   NaN   Mumbai
2  Charlie  35.0      NaN
3    David  40.0  Chennai

In [4]:
df_drop_rows

    Name   Age     City
0  Alice  25.0    Delhi
3  David  40.0  Chennai

In [5]:
df_drop_column = df.dropna(axis = 1)

In [6]:
df_drop_column

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [7]:
df = pd.DataFrame(data)

In [8]:
df.isnull()

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [9]:
df.notnull()

   Name    Age   City
0  True   True   True
1  True  False   True
2  True   True  False
3  True   True   True

In [12]:
df.isnull().sum()

Name    0
Age     2
City    1
dtype: int64

In [13]:
df_fill = df.fillna("Unknown")

In [14]:
df_fill

      Name      Age     City
0    Alice     25.0    Delhi
1      Bob  Unknown   Mumbai
2  Charlie  Unknown  Unknown
3    David     40.0  Chennai

In [15]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
print("\nAfter filling Age with mean:\n", df)

After filling Age with mean:
       Name   Age     City
0    Alice  25.0    Delhi
1      Bob  32.5   Mumbai
2  Charlie  32.5      NaN
3    David  40.0  Chennai

Try this:

Create a DataFrame with 3 columns: Name, Age, Score (include some np.nan values).

Count total missing values.

Fill Score with average score.

Drop rows where Age is missing.

In [16]:
record = {
    "Name" : ["vedansh", "tejaswi", np.nan],
    "Age": [18, np.nan, 19],
    "Score" : [78, np.nan, np.nan]
}

In [18]:
df = pd.DataFrame(record)

In [19]:
df.isnull()

    Name    Age  Score
0  False  False  False
1  False   True   True
2   True  False   True

In [20]:
df.isnull().sum()

Name     1
Age      1
Score    2
dtype: int64

In [28]:
avg_score = df['Score'].mean()
df['Score'] = df['Score'].fillna(avg_score)
print("\nAfter filling 'Score' with average:\n", df)

After filling 'Score' with average:
       Name   Age  Score
0  vedansh  18.0   78.0
2      NaN  19.0   78.0

C:\Users\vedan\AppData\Local\Temp\ipykernel_2836\190152897.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Score'] = df['Score'].fillna(avg_score)

In [23]:
df

      Name   Age  Score
0  vedansh  18.0   78.0
1  tejaswi   NaN   78.0
2      NaN  19.0   78.0

In [26]:
df = df.dropna(subset=['Age'])
print("\nFinal DataFrame after dropping rows with missing 'Age':\n", df)

Final DataFrame after dropping rows with missing 'Age':
       Name   Age  Score
0  vedansh  18.0   78.0
2      NaN  19.0   78.0

In [29]:
average_score = df["Score"].mean()

In [30]:
df["Score"]= df["Score"].fillna(average_score)

C:\Users\vedan\AppData\Local\Temp\ipykernel_2836\3324193729.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Score"]= df["Score"].fillna(average_score)

In [31]:
df

      Name   Age  Score
0  vedansh  18.0   78.0
2      NaN  19.0   78.0